app/controllers/products_controller.rb

  def update
    @product = Product.find(params[:id])

    return redirect_to @product,
          notice: 'Produto editado com sucesso'if @product.update(product_params)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "code" = $1, "title" = $2, "description" = $3, "price" = $4, "quantity" = $5, "category" = $6, "updated_at" = $7 WHERE "products"."id" = $8

  def create
    @product= Product.new(product_params)

    return redirect_to @product,
           notice: 'Produto registrado com sucesso' if @product.save!
---
INSERT INTO "products" ("code", "title", "description", "price", "quantity", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    @product = Product.find(params[:id])

    return redirect_to products_path,
      alert: 'Produto deletado com sucesso' if @product.destroy
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 82], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 82]]